app/controllers/answer_controller.rb

SELECT  `answers`.* FROM `answers` WHERE `answers`.`user` = 'miushock' LIMIT 1
---
  def index
    base = 'http://www.zhihu.com/people/'
    user = params[:user]
    @person = Person.find_by_userlink(base + user)
    @answers = Answer.where('user = ?', user)