app/controllers/person_controller.rb

  def person_answer
    user = params[:user]
    @answers = Answer.where('user = ?', user)
---
SELECT `answers`.* FROM `answers` WHERE (user = 'zhu-xuan-86')